# Setup taps

# Install command line apps

brew 'ack'
brew 'bash'
brew 'ccat'
brew 'coreutils'
brew 'cookiecutter'
brew 'duti'
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'gist'
brew 'hub'
brew 'multimarkdown'
brew 'node'
brew 'sox'
brew 'pandoc'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux'
brew 'z'
brew 's3cmd'

tap 'nvie/autoenv'
brew 'autoenv'

# Install GUI Apps

brew 'caskroom/cask/brew-cask'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'acorn'
cask 'alfred'
cask 'audacity'
cask 'bartender'
cask 'caffeine'
cask 'daisydisk'
cask 'dayone-cli'
cask 'dropbox'
cask 'duet'
cask 'evernote'
cask 'flux'
cask 'google-drive'
cask 'hazel'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner'
cask 'kindle'
cask 'keyboard-maestro'
cask 'macvim'
cask 'marked'
cask 'nvalt'
cask 'path-finder'
cask 'r'
cask 'rstudio'
cask 'skim'
cask 'skype'
cask 'sublime-text3'
cask 'textexpander'
cask 'the-unarchiver'
cask 'ynab'


# Install fonts

cask 'font-source-code-pro'
