# Setup taps

# Install command line apps

brew 'coreutils'
brew 'sox'
brew 'multimarkdown'
brew 'the_silver_searcher'
brew 'git'
brew 'tmux'
brew 'z'
brew 'hub'
brew 'bash'
brew ‘s3cmd’

# Install GUI Apps

brew 'caskroom/cask/brew-cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask '1password'
cask 'acorn'
cask 'alfred'
cask 'audacity'
cask 'bartender'
cask 'caffeine'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'google-drive'
cask 'hazel'
cask 'iterm2'
cask 'karabiner'
cask 'keyboard-maestro'
cask 'macvim'
cask 'nvalt'
cask 'path-finder'
cask 'skype'
cask 'sublime-text3'
cask 'textexpander'
cask 'the-unarchiver'
cask 'ynab'


# Install fonts

cask 'font-source-code-pro'
